Revit 2024 API
BuiltInFailures.EditingFailures.UnableFilletSpecifiedRadius Property
 Unable to create Fillet with the specified radius.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId UnableFilletSpecifiedRadius { get; }
Visual Basic
Public Shared ReadOnly Property UnableFilletSpecifiedRadius As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UnableFilletSpecifiedRadius {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace